app/views/groups/index.html.erb

            <td><%= group.introduction %></td>
            <td><%= group.users.count %></td>
---
SELECT COUNT(*) FROM "users" INNER JOIN "group_users" ON "users"."id" = "group_users"."user_id" WHERE "group_users"."group_id" = ?  [["group_id", 1]]