app/views/groups/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "group_users" ON "users"."id" = "group_users"."user_id" WHERE "group_users"."group_id" = ?  [["group_id", 1]]
---
            <td>
              <% @group.users.each do |member| %>

SELECT 1 AS one FROM "users" INNER JOIN "group_users" ON "users"."id" = "group_users"."user_id" WHERE "group_users"."group_id" = ? AND "users"."id" = ? LIMIT ?  [["group_id", 1], ["id", 2], ["LIMIT", 1]]
---
                <%= link_to "Edit", edit_group_path(@group),class: "btn btn-sm btn-success edit_book_#{@group}" %>
              <% elsif @group.users.include?(current_user) %>