app/controllers/books_controller.rb

  def index
    if params[:latest]
      @books = Book.latest
    elsif params[:star_count]
      @books = Book.star_count
    else
      @books = Book.all
---
SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC
SELECT "books".* FROM "books" ORDER BY "books"."star" DESC

  def create
    @book = Book.new(book_params1)
    @book.user_id = current_user.id
    if @book.save
---
INSERT INTO "books" ("title", "body", "user_id", "star", "created_at", "updated_at", "tag") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "ワンピース"], ["body", "カイドウ強かったな"], ["user_id", 1], ["star", 3.5], ["created_at", "2022-06-21 11:36:59.507000"], ["updated_at", "2022-06-21 11:36:59.507000"], ["tag", "和のくに"]]

  def update
    if @book.update(book_params2)
---
UPDATE "books" SET "updated_at" = ?, "tag" = ? WHERE "books"."id" = ?  [["updated_at", "2022-06-21 12:06:05.941631"], ["tag", "和の国"], ["id", 1]]

  def search
    if params[:tag].present?
      @books = Book.where('tag LIKE?', "#{params[:tag]}%")
---
SELECT "books".* FROM "books" WHERE (tag LIKE'アラバスタ%')