app/controllers/groups_controller.rb

  def join
    @group = Group.find(params[:group_id])
    @group.users << current_user
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "groups" ("name", "introduction", "owner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "麦わらの一味"], ["introduction", "海賊王になる"], ["owner_id", 1], ["created_at", "2022-06-22 02:07:00.569955"], ["updated_at", "2022-06-22 02:07:00.569955"]]
INSERT INTO "group_users" ("user_id", "group_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["group_id", 1], ["created_at", "2022-06-22 06:53:24.566952"], ["updated_at", "2022-06-22 06:53:24.566952"]]

  def create
    @group = Group.new(group_params)
    @group.owner_id = current_user.id
    @group.users << current_user
    if @group.save
---
INSERT INTO "group_users" ("user_id", "group_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["group_id", 1], ["created_at", "2022-06-22 06:38:42.082751"], ["updated_at", "2022-06-22 06:38:42.082751"]]
INSERT INTO "groups" ("name", "introduction", "owner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "麦わらの一味"], ["introduction", "海賊王になる"], ["owner_id", 1], ["created_at", "2022-06-22 02:07:00.569955"], ["updated_at", "2022-06-22 02:07:00.569955"]]
INSERT INTO "groups" ("name", "introduction", "owner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "麦わらの一味"], ["introduction", "海賊王になる"], ["owner_id", 1], ["created_at", "2022-06-22 06:38:42.077732"], ["updated_at", "2022-06-22 06:38:42.077732"]]

  def update
    @group = Group.find(params[:id])
    @group.owner_id = current_user.id
    if @group.update(group_params)
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "groups" SET "updated_at" = ? WHERE "groups"."id" = ?  [["updated_at", "2022-06-22 06:52:18.254628"], ["id", 1]]