app/models/user.rb

INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 2], ["followed_id", 1], ["created_at", "2022-06-22 06:24:12.320647"], ["updated_at", "2022-06-22 06:24:12.320647"]]
---
  def follow(user)
    relationships.create(followed_id: user.id)